students = {'Абдрахманов Мартин': [1, 1, 1, 1, 1, 0],
            'Бархатова Наташа': [0, 0, 1, 1, 0, 0],
            'Белоус Ярослав': [1, 1, 0, 0, 1, 1],
            'Бембеев Леонид': [1, 1, 1, 0, 0, 1],
            'Бордюг Владислав': [1, 1, 0, 1, 1, 1],
            'Буров Глеб': [1, 1, 0, 1, 1, 0],
            'Ветошкин Ростислав': [1, 1, 1, 1, 0, 1],
            'Влазнев Данила': [1, 0, 1, 1, 0, 0],
            'Власов Александр': [1, 1, 0, 1, 0, 1],
            'Даниленко Дмитрий': [1, 1, 1, 0, 1, 0],
            'Денисов Илья': [1, 0, 0, 0, 1, 1],
            'Егорова Валерия': [0, 0, 0, 0, 1, 1],
            'Зайнулина Алина': [0, 1, 1, 1, 0, 0],
            'Зенкин Даниил ': [1, 1, 0, 0, 1, 0],
            'Ишанова Надежда': [0, 0, 1, 1, 1, 0],
            'Калачева Вера': [0, 1, 0, 1, 1, 1],
            'Клопов Михаил': [1, 0, 0, 0, 1, 0],
            'Колсанов Ярослав': [1, 0, 0, 0, 0, 1],
            'Коршунов Кирилл': [1, 0, 1, 1, 0, 1],
            'Крашенинникова Даша': [0, 0, 0, 1, 1, 0],
            'Куцак Настя': [0, 1, 1, 0, 0, 1],
            'Маноменов Иван': [1, 0, 0, 1, 1, 0],
            'Марков Даниил': [1, 1, 1, 1, 1, 1],
            'Панает Витя': [1, 1, 0, 0, 0, 1],
            'Париш Павел': [1, 0, 1, 1, 1, 0],
            'Петрова Виктория': [0, 0, 0, 1, 0, 1],
            'Рудкина Дарья': [0, 0, 1, 0, 0, 1],
            'Соколова Дарья': [0, 0, 1, 0, 1, 1],
            'Трофимцова Катя': [0, 1, 0, 0, 0, 0],
            'Федоров Влад': [1, 1, 1, 0, 1, 1],
            'Цховребов Андрей': [1, 1, 1, 1, 0, 0],
            }
answers = ['Студент мужского пола? ',
           'У студента темный цвет волос? ',
           'Студент предпочитает фаст-фуд? ',
           'Студент больше любит одиночество? ',
           'Студент носит свободную одежду? ',
           'Студент любит спорт? ']
char = [[1, 0], [1, 0], [1, 0], [1, 0], [1, 0], [1, 0]]
res = []
k = 0
for i in answers:
    ask = input(i)
    if ask == 'да':
        res.append(char[k][0])
    else:
        res.append(char[k][1])
    k += 1
for i in students.keys():
    if students[i] == res:
        print(i)


